// import React, {useState} from 'react';
// import {
//     DoubleRightOutlined, GiftFilled, InstagramOutlined,
//     QuestionOutlined,
//     ThunderboltFilled,
//     UserAddOutlined
// } from '@ant-design/icons';
// import {Link} from "react-router-dom";
// import Slider from "react-slick";
// import "slick-carousel/slick/slick.css";
// import "slick-carousel/slick/slick-theme.css";
//
// const bgColor = window.Telegram?.WebApp?.themeParams?.bg_color;
// const color = window.Telegram?.WebApp?.themeParams?.text_color;
// const btnColor = window.Telegram?.WebApp?.themeParams?.button_color;
// const btnText = window.Telegram?.WebApp?.themeParams?.button_text_color
// const HintColor = window.Telegram?.WebApp?.themeParams?.hint_color
// const LinkColor = window.Telegram?.WebApp?.themeParams?.link_color
// const secondaryBG = window.Telegram?.WebApp?.themeParams?.secondary_bg_color
//
// const plans = [
//     {
//         title: "FREE",
//         tokens: "5 ТОКЕНОВ",
//         features: [
//             "Пробные запросы почти во всех инструментах",
//             "5 демо-запросов в языковые модели",
//             "3 запроса/день в Dall-e 3",
//             "3 запроса/день в Stable Diffusion",
//             "5 запросов/день во FLUX:1",
//             "Бесплатно Kling Try-On"
//         ]
//     },
//     {
//         title: "BASIC",
//         tokens: "260 ТОКЕНОВ",
//         price: "790.00₽ / 7.90€ / 8.01$",
//         priceWithToken: "890.00₽ / 8.90€ / 8.91$",
//         features: [
//             "Частичный функционал чат-бота",
//             "+ 10 запросов/час в языковые модели",
//             "+ 60 запросов/24ч. в языковые модели",
//             "Безлимит GPT 40-mini, Claude Haiku",
//             "Бесплатно Stable Diffusion",
//             "Бесплатно Kling Try-On",
//             "Бесплатно Google AI Editor",
//             "Бесплатно Google Imagen 4"
//         ]
//     },
//     {
//         title: "PRO",
//         tokens: "680 ТОКЕНОВ",
//         price: "1490.00₽ / 14.90€ / 15.21$",
//         priceWithToken: "1690.00₽ / 16.90€ / 17.01$",
//         features: [
//             "Полный функционал чат-бота",
//             "+ 25 запросов/час в языковые модели",
//             "+ 150 запросов/24ч. в языковые модели",
//             "Безлимит GPT 40-mini, Claude Haiku",
//             "Бесплатно Stable Diffusion",
//             "Бесплатно Kling Try-On",
//             "Бесплатно Google AI Editor",
//             "Бесплатно Google Imagen 4"
//         ]
//     },
//     {
//         title: "VIP",
//         tokens: "1700 ТОКЕНОВ",
//         price: "3990.00₽ / 39.90€ / 41.31$",
//         features: [
//             "Полный функционал чат-бота",
//             "Безлимит в языковых моделях",
//             "Бесплатно Dall-e 3 через GPT",
//             "Бесплатно Stable Diffusion",
//             "Бесплатно Kling Try-On",
//             "Бесплатно Google AI Editor",
//             "Бесплатно Google Imagen 4"
//         ]
//     },
//     {
//         title: "ELITE",
//         tokens: "2600 ТОКЕНОВ",
//         price: "4990.00₽ / 49.90€ / 49.41$",
//         priceWithToken: "5990.00₽ / 59.90€ / 62.01$",
//         features: [
//             "Полный функционал чат-бота",
//             "Безлимит в языковых моделях",
//             "Бесплатно RunWay",
//             "Бесплатно Sora Images (GPT Images)",
//             "Бесплатно Topaz AI",
//             "Бесплатно Stable Diffusion",
//             "Бесплатно Kling Try-On",
//             "Бесплатно Google AI Editor",
//             "Бесплатно Google Imagen 4"
//         ]
//     },
//     {
//         title: "ULTRA ELITE",
//         tokens: "2600 ТОКЕНОВ",
//         price: "9990.00₽ / 99.00€ / 99$",
//         priceWithToken: "11990.00₽ / 119.00€ / 118.8$",
//         features: [
//             "Все что в Elite, а также:",
//             "Бесплатно Sora Video",
//             "Бесплатно MiniMax",
//             "Бесплатно Luma",
//             "Бесплатно HeyGen"
//         ]
//     }
// ];
//
//
//
// const Sub = () => {
//     const [activeSlide, setActiveSlide] = useState(Math.floor(plans.length / 2));
//     const [withTokens, setWithTokens] = useState(true); // глобально для всех тарифов
//
//     const settings = {
//         dots: false,
//         infinite: false,
//         speed: 500,
//         slidesToShow: 1,
//         slidesToScroll: 1,
//         centerMode: true,
//         centerPadding: "60px",
//         initialSlide: activeSlide,
//         afterChange: (current) => setActiveSlide(current),
//     };
//     return (
//         <div className={'flex flex-col justify-between'} style={{minHeight: '100vh', color: `${color}`}}>
//             <div className="w-full flex p-2">
//                 <div className="w-1/2">
//                     <div className="flex flex-col items-center gap-1 mb-4">
//                         <svg width="75px" height="85px" fill={color} viewBox="60 105 75 70" version="1.1" id="svg1"
//                              space="preserve"
//                         >
//                             <defs id="defs1"></defs>
//                             <g id="layer1">
//                                 <path
//                                     d="m 94.326665,180.21418 c -0.119916,-0.19403 -0.04991,-0.35278 0.155569,-0.35278 0.205478,0 0.373597,0.15875 0.373597,0.35278 0,0.19403 -0.07001,0.35278 -0.155569,0.35278 -0.08556,0 -0.253681,-0.15875 -0.373597,-0.35278 z m -15.434028,-4.8537 c -4.819567,-0.0834 -5.909027,-0.19455 -5.909027,-0.60288 0,-0.27535 0.352823,-0.74776 0.784051,-1.0498 1.219939,-0.85448 0.104717,-0.68617 -3.451902,0.52096 -1.992242,0.67618 -3.687547,1.03333 -4.605049,0.97014 l -1.452067,-0.1 3.547188,-3.0868 3.547188,-3.08681 9.722934,-0.0847 c 12.092895,-0.10536 15.177229,0.006 16.072934,0.58195 0.411038,0.26416 2.399034,0.53767 4.762503,0.65524 4.25394,0.21161 5.28433,0.42343 5.30288,1.09014 0.006,0.22177 0.23328,0.69631 0.50468,1.05453 0.46157,0.6092 0.53956,0.56095 1.20664,-0.74665 0.39225,-0.76887 1.1374,-1.90209 1.65589,-2.51828 1.15473,-1.37232 0.92789,-1.70991 -0.62241,-0.92629 -1.07538,0.54356 -5.90604,1.3266 -6.2615,1.01497 -0.0847,-0.0743 2.15715,-2.47346 4.98199,-5.33146 4.69564,-4.75075 5.17593,-5.3552 5.60065,-7.04846 0.25551,-1.01864 0.6142,-1.85208 0.7971,-1.85208 0.60647,0 -0.0282,-2.7797 -0.87167,-3.8177 -2.08259,-2.56288 -12.49649,-13.48505 -13.01418,-13.64936 -0.31878,-0.10118 -0.92727,-0.55404 -1.352212,-1.00637 -0.6494,-0.69126 -0.881845,-1.71392 -1.457451,-6.4122 -0.376655,-3.07437 -0.610227,-5.66437 -0.519048,-5.75555 0.09118,-0.0912 6.037301,5.7736 13.213611,13.03284 13.86784,14.0281 14.05345,14.21818 16.92369,17.33077 l 1.85856,2.01548 -1.34926,1.27252 c -0.74209,0.69988 -1.51365,1.38041 -1.71458,1.51229 -0.20093,0.13188 -0.53681,0.55728 -0.7464,0.94534 -0.20959,0.38805 -1.08272,1.07195 -1.94028,1.51977 -0.96631,0.50461 -2.01184,1.47716 -2.74955,2.55764 -0.65468,0.95888 -1.41132,1.74342 -1.6814,1.74342 -0.27008,0 -0.75277,0.54883 -1.07265,1.21961 -0.31988,0.67079 -0.70443,1.1437 -0.85456,1.05092 -0.15012,-0.0928 -0.40178,0.0448 -0.55922,0.30578 -0.15745,0.26097 -0.79597,0.84518 -1.41894,1.29824 -0.62297,0.45307 -1.05855,0.94371 -0.96795,1.0903 0.0906,0.1466 -0.79964,1.12559 -1.97833,2.17553 l -2.14306,1.90898 -5.55268,0.0682 -5.552685,0.0682 -2.120554,-1.91899 c -1.560595,-1.41226 -2.253813,-1.83281 -2.6252,-1.59262 -0.399243,0.2582 -0.136232,0.65669 1.259243,1.90788 l 1.763888,1.58152 -5.997222,-0.0322 c -3.298472,-0.0177 -6.235347,0.0264 -6.526388,0.0981 -0.291042,0.0717 -3.188229,0.0843 -6.438195,0.0281 z m 38.893753,-5.15727 c 0,-0.0733 0.27781,-0.35107 0.61736,-0.61736 0.55952,-0.43881 0.572,-0.42633 0.13319,0.13319 -0.46086,0.58764 -0.75055,0.77452 -0.75055,0.48417 z m -34.153301,-2.00552 c 0.08489,-0.25466 0.362699,-0.53248 0.617361,-0.61736 0.264583,-0.0882 0.396875,0.0441 0.30868,0.30868 -0.08489,0.25466 -0.362699,0.53247 -0.617361,0.61736 -0.264583,0.0882 -0.396875,-0.0441 -0.30868,-0.30868 z m 17.751631,-1.38502 c -0.12359,-0.19998 0.018,-0.25912 0.33196,-0.13865 0.61115,0.23452 0.72297,0.48738 0.21553,0.48738 -0.18258,0 -0.42895,-0.15693 -0.54749,-0.34873 z m -11.3117,-7.85959 c -9.862208,-10.22093 -18.73087,-19.73903 -19.913945,-21.37222 -0.553395,-0.76394 -1.374576,-1.6406 -1.824846,-1.94815 -0.450271,-0.30754 -1.974173,-1.71346 -3.386449,-3.12426 l -2.567774,-2.5651 2.391385,-2.26635 c 1.315262,-1.2465 4.693261,-4.4499 7.506663,-7.11869 5.183182,-4.91674 9.689049,-8.78302 10.235977,-8.78302 0.164896,0 0.402227,-0.32268 0.527402,-0.71707 0.125175,-0.3944 1.032932,-1.46596 2.017237,-2.38125 0.984306,-0.9153 1.992352,-1.86247 2.240103,-2.10483 0.351118,-0.34347 5.605148,-0.43964 23.824977,-0.43608 12.85599,0.003 23.22591,0.13341 23.04427,0.29088 -0.73898,0.64068 -7.82517,5.66327 -8.9733,6.36016 -1.16094,0.70466 -1.70502,0.74952 -9.10485,0.75076 -5.82159,9.8e-4 -7.80514,-0.10382 -7.62048,-0.40261 0.17909,-0.28978 -0.0393,-0.32625 -0.77293,-0.12907 -0.56242,0.15118 -4.38574,0.37263 -8.496276,0.49213 l -7.473702,0.21726 -2.560969,2.74844 c -1.408534,1.51165 -2.614458,3.09893 -2.679833,3.52731 -0.147228,0.96473 -1.74391,3.42564 -2.222612,3.42564 -0.193709,0 0.05813,-0.65 0.559638,-1.44444 0.501509,-0.79445 0.83734,-1.51894 0.74629,-1.60999 -0.183623,-0.18362 -9.512457,9.23016 -9.712773,9.80122 -0.186613,0.532 1.363089,2.0496 1.887466,1.84838 0.248401,-0.0953 0.787318,0.29811 1.197594,0.87429 0.449497,0.63126 0.991139,0.9994 1.362891,0.92633 1.982122,-0.38962 3.399318,-0.46447 2.854606,-0.15077 -0.361893,0.20842 -0.514189,0.60572 -0.399827,1.04304 0.128541,0.49154 0.01126,0.70638 -0.385587,0.70638 -0.97447,0 -0.65239,0.6826 1.909127,4.04607 1.363691,1.79063 2.545158,3.59695 2.625482,4.01404 0.235365,1.22216 1.124819,2.28471 2.709081,3.23631 1.561188,0.93773 2.135262,1.75636 1.231675,1.75636 -0.730106,0 2.005005,5.49214 3.000411,6.02486 1.099155,0.58825 1.104829,0.21463 0.01966,-1.29422 -1.939924,-2.69732 -1.49716,-2.38485 2.629693,1.85586 4.079635,4.19219 4.221845,4.29905 6.030255,4.53102 2.10085,0.26949 2.39881,0.68715 0.70555,0.98899 -2.33403,0.41607 -9.619779,1.63744 -9.809888,1.64451 -0.108185,0.004 -1.61631,-1.46393 -3.351389,-3.26212 z m 3.024325,-13.16413 c 0.003,-1.148 0.169023,-2.32539 0.369006,-2.61644 0.256045,-0.37263 0.293775,0.20133 0.127546,1.94028 -0.296766,3.10453 -0.503566,3.38613 -0.496552,0.67616 z m 30.009305,0.46562 c -0.8321,-1.93111 -0.57352,-2.15863 0.71137,-0.62594 1.17508,1.40171 1.23034,1.62252 0.47827,1.91112 -0.39335,0.15094 -0.7254,-0.20778 -1.18964,-1.28518 z m -52.768873,-0.44896 c -0.582084,-0.26653 -0.820209,-0.48614 -0.529167,-0.48802 0.291042,-0.002 0.926042,0.22347 1.411111,0.50076 1.115344,0.63759 0.519523,0.62898 -0.881944,-0.0127 z m 33.344573,0.0213 c -0.27825,-0.33527 -0.30501,-0.53769 -0.0711,-0.53769 0.42635,0 0.92343,0.66929 0.67878,0.91394 -0.0888,0.0888 -0.36225,-0.0805 -0.60769,-0.37625 z m 11.05972,-8.44183 c 0.11878,-0.98849 0.21734,-2.15444 0.21903,-2.591 0.008,-2.04011 1.41199,0.0112 1.63249,2.38493 0.15349,1.65241 0.13948,1.67939 -0.95586,1.84016 l -1.11163,0.16315 z M 94.484875,130.4185 c -2.000959,-2.17803 -3.452495,-4.02192 -3.225636,-4.09754 0.463117,-0.15438 5.298095,0.54362 5.76515,0.83228 0.165488,0.10227 0.300887,0.58181 0.300887,1.06563 0,0.48383 0.253394,1.99377 0.563098,3.35544 0.309704,1.36166 0.489188,2.54966 0.398854,2.64 -0.09033,0.0903 -1.801394,-1.61778 -3.802353,-3.79581 z m -0.329197,-6.7161 c 0.003,-0.25398 0.15929,-0.69992 0.347376,-0.99096 0.278019,-0.4302 0.342984,-0.38461 0.347375,0.24377 0.003,0.42511 -0.153348,0.87104 -0.347375,0.99096 -0.194028,0.11991 -0.350347,0.0102 -0.347376,-0.24377 z m -0.35818,-6.65622 c 0,-0.20548 0.15875,-0.27549 0.352778,-0.15557 0.194028,0.11992 0.352778,0.28803 0.352778,0.3736 0,0.0856 -0.15875,0.15557 -0.352778,0.15557 -0.194028,0 -0.352778,-0.16812 -0.352778,-0.3736 z M 74.91994,113.9123 c 0.768741,-0.86696 1.916271,-1.577 2.158,-1.33527 0.08434,0.0843 -0.524569,0.59731 -1.353131,1.13994 -1.299608,0.85111 -1.410132,0.87793 -0.804869,0.19533 z m 2.792651,-2.79259 c 0.718992,-0.80832 0.915463,-0.91296 0.915463,-0.48761 0,0.14735 -0.357187,0.48734 -0.79375,0.75553 -0.790931,0.48587 -0.791363,0.48492 -0.121713,-0.26792 z m 10.793241,-6.75275 c 0,-0.40912 3.240395,-0.41815 5.820833,-0.0162 1.485202,0.23133 1.164712,0.28218 -2.028472,0.32187 -2.32448,0.0289 -3.792361,-0.0894 -3.792361,-0.30564 z m 8.8857,-0.88941 c 0.205348,-0.20534 5.808668,-1.23208 6.636518,-1.21605 1.33803,0.0259 -0.70381,0.65656 -3.29059,1.01634 -3.108287,0.43233 -3.608391,0.46218 -3.345928,0.19971 z"
//                                     id="path4"></path>
//                             </g>
//                         </svg>
//                         <p className={'text-3xl font-bold'}>5.50<ThunderboltFilled
//                             style={{fontSize: '16px', color: `${LinkColor}`}}/></p>
//                         <div>💼 FREE</div>
//                     </div>
//                 </div>
//                 <div className={'w-1/2'}>
//                     <div className="flex flex-wrap gap-3 mb-4">
//                         <Link
//                             to={'/sub/'}
//                             className={`rounded-xl w-[calc(50%-0.5rem)] hover:hover:text-sky-500 h-[70px] flex flex-col items-center justify-center gap-1`}
//                             style={{background: secondaryBG}}
//                         >
//                             <UserAddOutlined style={{fontSize: '20px', color: `${LinkColor}`}}/>
//                             подписка
//                         </Link>
//                         <div
//                             className={`rounded-xl w-[calc(50%-0.5rem)] hover:hover:text-sky-500 h-[70px] flex flex-col items-center justify-center gap-1`}
//                             style={{background: secondaryBG}}
//                         >
//                             <ThunderboltFilled style={{fontSize: '20px', color: `${LinkColor}`}}/>
//                             токены
//                         </div>
//                         <div
//                             className={`rounded-xl w-[calc(50%-0.5rem)] hover:hover:text-sky-500 h-[70px] flex flex-col items-center justify-center gap-1`}
//                             style={{background: secondaryBG}}
//                         >
//                             <QuestionOutlined style={{fontSize: '20px', color: `${LinkColor}`}}/>
//                             FAQ
//                         </div>
//                         <div
//                             className={`rounded-xl w-[calc(50%-0.5rem)] hover:hover:text-sky-500 h-[70px] flex flex-col items-center justify-center gap-1`}
//                             style={{background: secondaryBG}}
//                         >
//                             <DoubleRightOutlined
//                                 style={{
//                                     fontSize: '20px',
//                                     color: `${LinkColor}`,
//                                     transform: 'rotate(90deg)',
//                                 }}
//                             />
//                             еще
//                         </div>
//                     </div>
//                 </div>
//             </div>
//             <div className="w-full ">
//                 <Slider {...settings}>
//                     {plans.map((plan, index) => {
//                         const hasToggle = plan.price && plan.priceWithToken;
//
//                         // Локальное состояние для переключения токенов
//                         const [localWithTokens, setLocalWithTokens] = useState(true);
//
//                         return (
//                             <div
//                                 key={index}
//                                 className={`w-full duration-100
//                 ${index === activeSlide ? "scale-100 opacity-100" : "scale-90 opacity-70"}
//             `}
//                             >
//                                 <div
//                                     style={{ background: secondaryBG }}
//                                     className="p-4 rounded-xl w-full h-full shadow-lg flex flex-col"
//                                 >
//                                     <h2 className="text-2xl font-bold mb-2">{plan.title}</h2>
//
//                                     {hasToggle && (
//                                         <div className="relative w-full max-w-[260px] h-10 bg-transparent rounded-full border mb-4 flex items-center justify-between px-1">
//
//                                             <div style={{background:btnColor}}
//                                                 className={`absolute top-0 left-0 h-full w-1/2 rounded-full transition-transform duration-300 z-0 ${
//                                                     localWithTokens ? "translate-x-full" : "translate-x-0"
//                                                 }`}
//                                             ></div>
//
//                                             <button
//                                                 onClick={() => setLocalWithTokens(false)}
//                                                 className={`z-10 w-1/2 h-full flex items-center justify-center font-semibold text-sm transition-all ${
//                                                     !localWithTokens ? btnText : btnText
//                                                 }`}
//                                             >
//                                                 0 ТОКЕНОВ
//                                             </button>
//                                             <button
//                                                 onClick={() => setLocalWithTokens(true)}
//                                                 className={`z-10 w-1/2 h-full flex items-center justify-center font-semibold text-sm transition-all ${
//                                                     localWithTokens ? btnText : btnText
//                                                 }`}
//                                             >
//                                                 {plan.tokens}
//                                             </button>
//                                         </div>
//                                     )}
//
//                                     {/* Без тоггла */}
//                                     {!hasToggle && (
//                                         <div
//                                             className="font-semibold text-center py-2 rounded-full mb-4"
//                                             style={{ background: btnColor, color: btnText }}
//                                         >
//                                             {plan.tokens}
//                                         </div>
//                                     )}
//
//                                     <ul className="text-sm space-y-1 mb-4">
//                                         {plan.features.map((feature, idx) => (
//                                             <li key={idx} className="before:content-['+'] before:mr-2">
//                                                 {feature}
//                                             </li>
//                                         ))}
//                                     </ul>
//
//                                     <div className="mt-auto">
//                                         <p className="text-lg font-semibold mb-4 transition-all duration-300 ease-in-out">
//                                             {hasToggle
//                                                 ? localWithTokens
//                                                     ? plan.priceWithToken
//                                                     : plan.price
//                                                 : plan.price}
//                                         </p>
//                                         <button
//                                             className="w-full py-2 rounded-full transition duration-300"
//                                             style={{ background: LinkColor, color: bgColor }}
//                                         >
//                                             КУПИТЬ
//                                         </button>
//                                     </div>
//                                 </div>
//                             </div>
//                         );
//                     })}
//
//                 </Slider>
//
//             </div>
//
//             <div className="w-full h-[50px] flex items-center justify-between sticky bottom-0" style={{background: secondaryBG}}>
//                 <div className="w-1/4 flex flex-col items-center justify-center">
//                     <svg width={'20px'} fill={color} viewBox="0 0 14 14" role="img" focusable="false"
//                          aria-hidden="true"
//                          xmlns="http://www.w3.org/2000/svg">
//                         <g id="SVGRepo_bgCarrier" stroke-width="0"></g>
//                         <g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g>
//                         <g id="SVGRepo_iconCarrier">
//                             <path
//                                 d="m 5.1999993,6.999995 c 1.3256242,0 2.3999985,-1.07437 2.3999985,-2.4 0,-1.32562 -1.0743743,-2.39999 -2.3999985,-2.39999 -1.3256241,0 -2.3999984,1.07437 -2.3999984,2.39999 0,1.32563 1.0743743,2.4 2.3999984,2.4 z m 1.679999,0.6 -0.3131248,0 c -0.4162498,0.19125 -0.8793745,0.3 -1.3668742,0.3 -0.4874997,0 -0.9487494,-0.10875 -1.3668741,-0.3 l -0.3131248,0 c -1.3912491,0 -2.5199984,1.12875 -2.5199984,2.52 l 0,0.78 c 0,0.49688 0.4031248,0.9 0.8999994,0.9 l 6.5999958,0 c 0.4968747,0 0.8999995,-0.40312 0.8999995,-0.9 l 0,-0.78 c 0,-1.39125 -1.1287493,-2.52 -2.5199984,-2.52 z m 6.0562457,-2.4075 -0.521249,-0.52687 c -0.08625,-0.0881 -0.226875,-0.0881 -0.315,-0.002 l -1.964999,1.95 -0.8531243,-0.85875 c -0.08625,-0.0881 -0.2268748,-0.0881 -0.3149998,-0.002 l -0.5268746,0.52312 c -0.088125,0.0863 -0.088125,0.22688 -0.00188,0.315 l 1.531874,1.54313 c 0.08625,0.0881 0.2268747,0.0881 0.3149997,0.002 l 2.649373,-2.62875 c 0.08625,-0.0881 0.08812,-0.22875 0.0019,-0.315 z"></path>
//                         </g>
//                     </svg>
//                     <span className={'text-xs'}>Аккаунт</span>
//                 </div>
//                 <div className="w-1/4 flex flex-col items-center justify-center">
//                     <svg width={'20px'} fill={color} viewBox="0 -64 640 640" xmlns="http://www.w3.org/2000/svg">
//                         <g id="SVGRepo_bgCarrier" stroke-width="0"></g>
//                         <g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g>
//                         <g id="SVGRepo_iconCarrier">
//                             <path
//                                 d="M434.7 64h-85.9c-8 0-15.7 3-21.6 8.4l-98.3 90c-.1.1-.2.3-.3.4-16.6 15.6-16.3 40.5-2.1 56 12.7 13.9 39.4 17.6 56.1 2.7.1-.1.3-.1.4-.2l79.9-73.2c6.5-5.9 16.7-5.5 22.6 1 6 6.5 5.5 16.6-1 22.6l-26.1 23.9L504 313.8c2.9 2.4 5.5 5 7.9 7.7V128l-54.6-54.6c-5.9-6-14.1-9.4-22.6-9.4zM544 128.2v223.9c0 17.7 14.3 32 32 32h64V128.2h-96zm48 223.9c-8.8 0-16-7.2-16-16s7.2-16 16-16 16 7.2 16 16-7.2 16-16 16zM0 384h64c17.7 0 32-14.3 32-32V128.2H0V384zm48-63.9c8.8 0 16 7.2 16 16s-7.2 16-16 16-16-7.2-16-16c0-8.9 7.2-16 16-16zm435.9 18.6L334.6 217.5l-30 27.5c-29.7 27.1-75.2 24.5-101.7-4.4-26.9-29.4-24.8-74.9 4.4-101.7L289.1 64h-83.8c-8.5 0-16.6 3.4-22.6 9.4L128 128v223.9h18.3l90.5 81.9c27.4 22.3 67.7 18.1 90-9.3l.2-.2 17.9 15.5c15.9 13 39.4 10.5 52.3-5.4l31.4-38.6 5.4 4.4c13.7 11.1 33.9 9.1 45-4.7l9.5-11.7c11.2-13.8 9.1-33.9-4.6-45.1z"></path>
//                         </g>
//                     </svg>
//                     <span className={'text-xs'}>Партнерство</span>
//                 </div>
//                 <div className="w-1/4 flex flex-col items-center justify-center">
//                     <GiftFilled/>
//                     <span className={'text-xs'}>Партнерство</span>
//                 </div>
//                 <div className="w-1/4 flex flex-col items-center justify-center">
//                     <svg width={'18px'} viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg" fill={color}>
//                         <g id="SVGRepo_bgCarrier" stroke-width="0"></g>
//                         <g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g>
//                         <g id="SVGRepo_iconCarrier">
//                             <g>
//                                 <path fill="none" d="M0 0h24v24H0z"></path>
//                                 <path
//                                     d="M6.455 19L2 22.5V4a1 1 0 0 1 1-1h18a1 1 0 0 1 1 1v14a1 1 0 0 1-1 1H6.455zm5.563-4.3l3.359-3.359a2.25 2.25 0 0 0-3.182-3.182l-.177.177-.177-.177a2.25 2.25 0 0 0-3.182 3.182l3.359 3.359z"></path>
//                             </g>
//                         </g>
//                     </svg>
//                     <span className={'text-xs'}>Сообщество</span>
//                 </div>
//             </div>
//         </div>
//     );
// };
//
// export default Sub;